wosayttn/lv_port_nuvoton/bsp/m55m1/Library/Device/Nuvoton/M55M1/Source/startup_M55M1.c
    UART5_IRQHandler,                         /*!<  80 UART5 Interrupt Handler                          */
    UART6_IRQHandler,                         /*!<  81 UART6 Interrupt Handler                          */
    UART7_IRQHandler,                         /*!<  82 UART7 Interrupt Handler                          */
    UART8_IRQHandler,                         /*!<  83 UART8 Interrupt Handler                          */
    UART9_IRQHandler,                         /*!<  84 UART9 Interrupt Handler                          */
    0,                                        /*!<     Reserved                                         */
    0,                                        /*!<     Reserved                                         */
    0,                                        /*!<     Reserved                                         */
    EINT6_IRQHandler,                         /*!<  88 External Input 6 Interrupt Handler               */
    EINT7_IRQHandler,                         /*!<  89 External Input 7 Interrupt Handler               */

    LPUART0_IRQHandler,                       /*!<  90 Low Power UART 0 Interrupt Handler               */
    0,                                        /*!<     Reserved                                         */
    I2C0_IRQHandler,                          /*!<  92 I2C0 Interrupt Handler                           */
    I2C1_IRQHandler,                          /*!<  93 I2C1 Interrupt Handler                           */
    I2C2_IRQHandler,                          /*!<  94 I2C2 Interrupt Handler                           */
    I2C3_IRQHandler,                          /*!<  95 I2C3 Interrupt Handler                           */
    LPI2C0_IRQHandler,                        /*!<  96 Low Power I2C 0 Interrupt Handler                */
    USCI0_IRQHandler,                         /*!<  97 USCI0 Interrupt Handler                          */
    0,                                        /*!<     Reserved                                         */
    SC0_IRQHandler,                           /*!<  99 Smart Card Host 0 Interrupt Handler              */

    SC1_IRQHandler,                           /*!< 100 Smart Card Host 1 Interrupt Handler              */
    SC2_IRQHandler,                           /*!< 101 Smart Card Host 2 Interrupt Handler              */
    PSIO_IRQHandler,                          /*!< 102 PSIO Interrupt Handler                           */
    DMIC0_IRQHandler,                         /*!< 103 DMIC0 Interrupt Handler                          */
    DMIC0VAD_IRQHandler,                      /*!< 104 DMIC0 VAD Interrupt Handler                      */
    I2S0_IRQHandler,                          /*!< 105 I2S0 Interrupt Handler                           */
    I2S1_IRQHandler,                          /*!< 106 I2S1 Interrupt Handler                           */
    TRNG_IRQHandler,                          /*!< 107 TRNG Interrupt Handler                           */
    I3C0_IRQHandler,                          /*!< 108 I3C0 Interrupt Handler                           */
    0,                                        /*!<     Reserved                                         */

    OTFC0_IRQHandler,                         /*!< 110 OTFC0 Interrupt Handler                          */
    0,                                        /*!<     Reserved                                         */
    KPI_IRQHandler,                           /*!< 112 KPI Interrupt Handler                            */
    SDH0_IRQHandler,                          /*!< 113 SD Host 0 Interrupt Handler                      */
    SDH1_IRQHandler,                          /*!< 114 SD Host 1 Interrupt Handler                      */
    CCAP_IRQHandler,                          /*!< 115 CCAP Interrupt Handler                           */
    CRYPTO_IRQHandler,                        /*!< 116 CRYPTO Interrupt Handler                         */
    CANFD00_IRQHandler,                       /*!< 117 CANFD0 Interrupt 0 Handler                       */
    CANFD01_IRQHandler,                       /*!< 118 CANFD0 Interrupt 1 Handler                       */
    CANFD10_IRQHandler,                       /*!< 119 CANFD1 Interrupt 0 Handler                       */

    CANFD11_IRQHandler,                       /*!< 120 CANFD1 Interrupt 1 Handler                       */
    ACMP01_IRQHandler,                        /*!< 121 ACMP0 and ACMP1 Interrupt Handler                */
    ACMP23_IRQHandler,                        /*!< 122 ACMP2 and ACMP3 Interrupt Handler                */
    0,                                        /*!<     Reserved                                         */
    0,                                        /*!<     Reserved                                         */
    CRC_IRQHandler,                           /*!< 125 CRC Interrupt Handler                            */
    EADC00_IRQHandler,                        /*!< 126 EADC0 Interrupt 0 Handler                        */
    EADC01_IRQHandler,                        /*!< 127 EADC0 Interrupt 1 Handler                        */
    EADC02_IRQHandler,                        /*!< 128 EADC0 Interrupt 2 Handler                        */
    EADC03_IRQHandler,                        /*!< 129 EADC0 Interrupt 3 Handler                        */

    0,                                        /*!<     Reserved                                         */
    0,                                        /*!<     Reserved                                         */
    0,                                        /*!<     Reserved                                         */
    0,                                        /*!<     Reserved                                         */
    LPADC0_IRQHandler,                        /*!< 134 Low Power ADC 0 Interrupt Handler                */
    DAC01_IRQHandler,                         /*!< 135 DAC0 and DAC1 Interrupt Handler                  */
    0,                                        /*!<     Reserved                                         */
    EQEI0_IRQHandler,                         /*!< 137 EQEI0 Interrupt Handler                          */
    EQEI1_IRQHandler,                         /*!< 138 EQEI1 Interrupt Handler                          */
    EQEI2_IRQHandler,                         /*!< 139 EQEI2 Interrupt Handler                          */

    EQEI3_IRQHandler,                         /*!< 140 EQEI3 Interrupt Handler                          */
    ECAP0_IRQHandler,                         /*!< 141 ECAP0 Interrupt Handler                          */
    ECAP1_IRQHandler,                         /*!< 142 ECAP1 Interrupt Handler                          */
    ECAP2_IRQHandler,                         /*!< 143 ECAP2 Interrupt Handler                          */
    ECAP3_IRQHandler,                         /*!< 144 ECAP3 Interrupt Handler                          */
    0,                                        /*!<     Reserved                                         */
    0,                                        /*!<     Reserved                                         */
    0,                                        /*!<     Reserved                                         */
    0,                                        /*!<     Reserved                                         */
    AWF_IRQHandler,                           /*!< 149 AWF Interrupt Handler                            */

