wosayttn/lv_port_nuvoton/bsp/m55m1/Library/Device/Nuvoton/M55M1/Source/startup_M55M1.c
    UTCPD_IRQHandler,                         /*!< 150 UTCPD Interrupt Handler                          */
    ETI_IRQHandler,                           /*!< 151 ETI Interrupt Handler                            */
    0,                                        /*!<     Reserved                                         */
    0,                                        /*!<     Reserved                                         */
    0,                                        /*!<     Reserved                                         */
    0,                                        /*!<     Reserved                                         */
    0,                                        /*!<     Reserved                                         */
    0,                                        /*!<     Reserved                                         */
    0,                                        /*!<     Reserved                                         */
    0,                                        /*!<     Reserved                                         */

    GDMACH0_IRQHandler,                       /*!< 160 GDMA Channel 0 Interrupt Handler                 */
    GDMACH1_IRQHandler,                       /*!< 161 GDMA Channel 1 Interrupt Handler                 */
};

#if defined ( __GNUC__ )
    #pragma GCC diagnostic pop
#endif


/*----------------------------------------------------------------------------
  Reset Handler called on controller reset
 *----------------------------------------------------------------------------*/
__NO_RETURN void Reset_Handler(void)
{
    // Copy __set_PSP/__set_MSPLIM/__set_PSPLIM from cmsis_armclang.h
    __ASM volatile("MSR psp, %0" : : "r"((uint32_t)(&__INITIAL_SP)) :);
    __ASM volatile("MSR msplim, %0" : : "r"((uint32_t)(&__STACK_LIMIT)));
    __ASM volatile("MSR psplim, %0" : : "r"((uint32_t)(&__STACK_LIMIT)));

    // Move other code to Reset_Handler_Main to prevent compiler generate stack access code.
    // Move stack pointer before setting MSPLIM might cause hard fault due to MSPLIM violation.
    Reset_Handler_Main();
}

__NO_RETURN void Reset_Handler_Main(void)
{
    if ((__PC() & NS_OFFSET) == 0)
    {
        // Unlock protected registers
        do
        {
            SYS->REGLCTL = 0x59UL;
            SYS->REGLCTL = 0x16UL;
            SYS->REGLCTL = 0x88UL;
        } while (SYS->REGLCTL == 0UL);

        // Switch SRAM0 to normal power mode
        if (PMC->SYSRB0PC != 0)
        {
            PMC->SYSRB0PC = 0;

            while (PMC->SYSRB0PC & PMC_SYSRB0PC_PCBUSY_Msk)
                ;
        }

        // Enable SRAM0 clock
        CLK->SRAMCTL |= CLK_SRAMCTL_SRAM0CKEN_Msk;

        // Switch SRAM1 to normal power mode
        if (PMC->SYSRB1PC != 0)
        {
            PMC->SYSRB1PC = 0;

            while (PMC->SYSRB1PC & PMC_SYSRB1PC_PCBUSY_Msk)
                ;
        }

        // Enable SRAM1 clock
        CLK->SRAMCTL |= CLK_SRAMCTL_SRAM1CKEN_Msk;
    }

#if (defined (__FPU_USED) && (__FPU_USED == 1U)) || \
    (defined (__ARM_FEATURE_MVE) && (__ARM_FEATURE_MVE > 0U))
    SCB->CPACR |= ((3U << 10U * 2U) |         /* Enable CP10 Full Access */
                   (3U << 11U * 2U));         /* Enable CP11 Full Access */

    /* Set low-power state for PDEPU                */
    /*  0b00  | ON, PDEPU is not in low-power state */
    /*  0b01  | ON, but the clock is off            */
    /*  0b10  | RET(ention)                         */
    /*  0b11  | OFF                                 */

    /* Clear ELPSTATE, value is 0b11 on Cold reset */
    PWRMODCTL->CPDLPSTATE &= ~(PWRMODCTL_CPDLPSTATE_ELPSTATE_Msk << PWRMODCTL_CPDLPSTATE_ELPSTATE_Pos);

    /* Favor best FP/MVE performance by default, avoid EPU switch-ON delays */
    /* PDEPU ON, Clock OFF */
    PWRMODCTL->CPDLPSTATE |= 0x1 << PWRMODCTL_CPDLPSTATE_ELPSTATE_Pos;
#endif
	
#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
    __TZ_set_STACKSEAL_S((uint32_t *)(&__STACK_SEAL));
#endif

    SCB_InvalidateICache();
    SCB_EnableICache();

#ifdef NVT_DCACHE_ON
    SCB_InvalidateDCache();
    SCB_EnableDCache();
#endif  // NVT_DCACHE_ON

    __PROGRAM_START();      // Enter PreMain (C library entry point)
}

#if defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic push
    #pragma clang diagnostic ignored "-Wmissing-noreturn"
#endif


/*----------------------------------------------------------------------------
  Hard Fault Handler
 *----------------------------------------------------------------------------*/
extern void ProcessHardFault(uint32_t *pu32StackFrame);

struct StackFrame
{
    uint32_t r0;
    uint32_t r1;
    uint32_t r2;
    uint32_t r3;
    uint32_t r12;
    uint32_t lr;
    uint32_t pc;
    uint32_t xPsr;
};

void HardFault_Handler(void)
{
    uint32_t u32IRQ;
    struct StackFrame *psStackFrame = NULL;

    (void)u32IRQ;
    __ASM volatile("mrs %0, ipsr            \n" // Read IPSR (Exception number)
                   "sub %0, #16             \n" // Get it into IRQn_Type range
                   "tst lr, #4              \n" // Select the stack which was in use
                   "ite eq                  \n"
                   "mrseq %1, msp           \n"
                   "mrsne %1, psp           \n"
                   : "=r"(u32IRQ), "=r"(psStackFrame));

    // Get the instruction caused the hardfault
    ProcessHardFault((uint32_t *)psStackFrame);
}

/*----------------------------------------------------------------------------
  Default Handler for Exceptions / Interrupts
 *----------------------------------------------------------------------------*/
void Default_Handler(void)
{
    while (1);
}

#if defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic pop
#endif
